import { PrismaClient, Prisma } from "../src/generated/prisma";

const prisma = new PrismaClient();

const landingData: Prisma.LandingCreateInput = 
    {
        id: 1,
        header: "تطوير المهارات مع دخل اضافي",
        headerDescription: "تقدم منجز برنامج البائعة المحترفة، والذي يهدف إلى تمكين الطالبات من تطوير مهاراتهم الاحترافية في مجال المبيعات، بالإضافة إلى الحصول على دخل مادي إضافي من خلال نموذج عمل مرن يعتمد على الدخل مقابل الإنجاز، دون الحاجة إلى خبرة مسبقة أو رأس مال",
        tipSectionTitle: "مهارات اليوم هي فرص ..الغد.. انطلقي نحو مستقبل مهني واعد ودخل مستدام يواكب طموحك",
        tipSectionDescription: "برنامج البائعة المحترفة هو مبادرة نوعية تقدمها شركة منجز تهدف إلى تمكين الطالبات الجامعيات من تطوير مهاراتهم الاحترافية في مجال المبيعات، مع فرصة حقيقية للحصول على دخل مادي إضافي من خلال نموذج عمل مرن يعتمد على الإنجاز. لا يشترط البرنامج أي خبرة سابقة أو رأس مال بل يوفر تدريبا مجانيًا وشهادات احترافية تساعد المشاركات على بناء مستقبل مهني متميز بخطوات واثقة",
        goalSection: [
            {
                header: "تمكين الفتيات من دخول سوق العمل",
                description: "بطريقه مرنه ومستقله تعزز من قدراتهم المهنيه",
            },
            {
                header: "تحفيز الاداء من خلال الربح مقابل الجهد",
                description: "حيث يتزايد الدخل حسب حجم المبيعات",
            },
            {
                header: "اكتشاف الكفاءات الشابه",
                description: "وبناء قاعده بيانات من البائعات المحترفات لدعم سوق العمل المحلي بكفاءات سعوديه متميزه",
            }
        ],
        featuresSection: [
            'دخل متزايد مع حجم المبيعات',
            'تدريب مجاني مع شهادات احترافيه',
            'مواقع عمل مناسبه وثابته',
            'اوقات عمل مرنه(من الساعه 4:00 م الي 11:30 م)',
        ],
        citiesSection: [
            "الدمام",
            "الهفوف",
            "الخبر",
            "الطائف",
            "خميس مشيط",
            "ابها",
            "نجران",
            "جازان",
            "المدينة المنورة",
            "الرياض",
            "القصيم",
            "حائل",
        ],
        sliderSection: [
            {
                title: "نبحث عن شابات سعوديات طموحان يمتلكن الرغبه في الانطلاق المهني والتطور",
                subTitle: "وتشمل شروط المشاركه:",
                terms: [
                    'طالبه جامعيه سعوديه',
                    'ملتزمه طموحه. ومستعده للتعلم والتطور',
                    'تبحث عن انطلاقه مهنيه قويه ومصدر دخل اضافي'
                ]
            },

        ],
        operatingEntitiesSection: [
            {
                name: "شركه منجز",
                description: "شركه سعوديه متخصصه في حلول التوظيف والتدريب تسعي لتمكين الشابات لدخول سوق العمل بكفائه من خلال برامج مرنه وتقنيات مبتكره تعزز الانتاجيه والفرص",
            },
            {
                name: "شركه ليبيور",
                description: "وكاله حائزه علي جوائز تمكن العلامات التجاريه من التاثير من خلال الاستراتيجيه. والابداع. والتنفيذ الجريء",
            }
        ]
    };

export async function main() {
   
        await prisma.landing.create({ data: landingData });
    
}

main();

